STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_cm33.h
/*!< APB1 peripherals defaults to Secure aliases */
#define TIM2                        TIM2_S
#define TIM2_BASE                   TIM2_BASE_S

#define TIM3                        TIM3_S
#define TIM3_BASE                   TIM3_BASE_S

#define TIM4                        TIM4_S
#define TIM4_BASE                   TIM4_BASE_S

#define TIM5                        TIM5_S
#define TIM5_BASE                   TIM5_BASE_S

#define TIM6                        TIM6_S
#define TIM6_BASE                   TIM6_BASE_S

#define TIM7                        TIM7_S
#define TIM7_BASE                   TIM7_BASE_S

#define TIM12                       TIM12_S
#define TIM12_BASE                  TIM12_BASE_S

#define TIM13                       TIM13_S
#define TIM13_BASE                  TIM13_BASE_S

#define TIM14                       TIM14_S
#define TIM14_BASE                  TIM14_BASE_S

#define LPTIM1                      LPTIM1_S
#define LPTIM1_BASE                 LPTIM1_BASE_S

#define LPTIM2                      LPTIM2_S
#define LPTIM2_BASE                 LPTIM2_BASE_S

#define SPI2                        SPI2_S
#define SPI2_BASE                   SPI2_BASE_S

#define SPI3                        SPI3_S
#define SPI3_BASE                   SPI3_BASE_S

#define SPDIFRX                     SPDIFRX_S
#define SPDIFRX_BASE                SPDIFRX_BASE_S

#define USART2                      USART2_S
#define USART2_BASE                 USART2_BASE_S

#define USART3                      USART3_S
#define USART3_BASE                 USART3_BASE_S

#define UART4                       UART4_S
#define UART4_BASE                  UART4_BASE_S

#define UART5                       UART5_S
#define UART5_BASE                  UART5_BASE_S

#define I2C1                        I2C1_S
#define I2C1_BASE                   I2C1_BASE_S

#define I2C2                        I2C2_S
#define I2C2_BASE                   I2C2_BASE_S

#define I2C3                        I2C3_S
#define I2C3_BASE                   I2C3_BASE_S

#define I2C4                        I2C4_S
#define I2C4_BASE                   I2C4_BASE_S

#define I2C5                        I2C5_S
#define I2C5_BASE                   I2C5_BASE_S

#define I2C6                        I2C6_S
#define I2C6_BASE                   I2C6_BASE_S

#define I2C7                        I2C7_S
#define I2C7_BASE                   I2C7_BASE_S

#define I3C1                        I3C1_S
#define I3C1_BASE                   I3C1_BASE_S

#define I3C2                        I3C2_S
#define I3C2_BASE                   I3C2_BASE_S

#define I3C3                        I3C3_S
#define I3C3_BASE                   I3C3_BASE_S

#define TIM10                       TIM10_S
#define TIM10_BASE                  TIM10_BASE_S

#define TIM11                       TIM11_S
#define TIM11_BASE                  TIM11_BASE_S

/*!< APB2 peripherals defaults to Secure aliases */
#define TIM1                        TIM1_S
#define TIM1_BASE                   TIM1_BASE_S

#define TIM8                        TIM8_S
#define TIM8_BASE                   TIM8_BASE_S

#define USART6                      USART6_S
#define USART6_BASE                 USART6_BASE_S

#define SPI1                        SPI1_S
#define SPI1_BASE                   SPI1_BASE_S

#define SPI4                        SPI4_S
#define SPI4_BASE                   SPI4_BASE_S

#define TIM15                       TIM15_S
#define TIM15_BASE                  TIM15_BASE_S

#define TIM16                       TIM16_S
#define TIM16_BASE                  TIM16_BASE_S

#define TIM17                       TIM17_S
#define TIM17_BASE                  TIM17_BASE_S

#define SPI5                        SPI5_S
#define SPI5_BASE                   SPI5_BASE_S

#define SAI1                        SAI1_S
#define SAI1_BASE                   SAI1_BASE_S

#define SAI1_Block_A                SAI1_Block_A_S
#define SAI1_Block_A_BASE           SAI1_Block_A_BASE_S

#define SAI1_Block_B                SAI1_Block_B_S
#define SAI1_Block_B_BASE           SAI1_Block_B_BASE_S

#define SAI2                        SAI2_S
#define SAI2_BASE                   SAI2_BASE_S

#define SAI2_Block_A                SAI2_Block_A_S
#define SAI2_Block_A_BASE           SAI2_Block_A_BASE_S

#define SAI2_Block_B                SAI2_Block_B_S
#define SAI2_Block_B_BASE           SAI2_Block_B_BASE_S

#define SAI3                        SAI3_S
#define SAI3_BASE                   SAI3_BASE_S

#define SAI3_Block_A                SAI3_Block_A_S
#define SAI3_Block_A_BASE           SAI3_Block_A_BASE_S

#define SAI3_Block_B                SAI3_Block_B_S
#define SAI3_Block_B_BASE           SAI3_Block_B_BASE_S

#define UART9                       UART9_S
#define UART9_BASE                  UART9_BASE_S
#define FDCAN1                      FDCAN1_S
#define FDCAN1_BASE                 FDCAN1_BASE_S

#define FDCAN2                      FDCAN2_S
#define FDCAN2_BASE                 FDCAN2_BASE_S

#define FDCAN3                      FDCAN3_S
#define FDCAN3_BASE                 FDCAN3_BASE_S

#define FDCAN_CCU                   FDCAN_CCU_S
#define FDCAN_CCU_BASE              CANCU_BASE_S
#define TIM20                       TIM20_S
#define TIM20_BASE                  TIM20_BASE_S

#define USART1                      USART1_S
#define USART1_BASE                 USART1_BASE_S

#define SAI4                        SAI4_S
#define SAI4_BASE                   SAI4_BASE_S

#define SAI4_Block_A                SAI4_Block_A_S
#define SAI4_Block_A_BASE           SAI4_Block_A_BASE_S

#define SAI4_Block_B                SAI4_Block_B_S
#define SAI4_Block_B_BASE           SAI4_Block_B_BASE_S

#define SPI6                        SPI6_S
#define SPI6_BASE                   SPI6_BASE_S

#define SPI7                        SPI7_S
#define SPI7_BASE                   SPI7_BASE_S

#define UART7                       UART7_S
#define UART7_BASE                  UART7_BASE_S

#define UART8                       UART8_S
#define UART8_BASE                  UART8_BASE_S

