STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_cm33.h
/*******************  Bit definition for DSI_WCR register  ********************/
#define DSI_WCR_COLM_Pos            (0U)
#define DSI_WCR_COLM_Msk            (0x1UL << DSI_WCR_COLM_Pos)           /*!< 0x00000001 */
#define DSI_WCR_COLM                DSI_WCR_COLM_Msk                     /*!< Color mode */
#define DSI_WCR_SHTDN_Pos           (1U)
#define DSI_WCR_SHTDN_Msk           (0x1UL << DSI_WCR_SHTDN_Pos)          /*!< 0x00000002 */
#define DSI_WCR_SHTDN               DSI_WCR_SHTDN_Msk                    /*!< Shutdown */
#define DSI_WCR_LTDCEN_Pos          (2U)
#define DSI_WCR_LTDCEN_Msk          (0x1UL << DSI_WCR_LTDCEN_Pos)         /*!< 0x00000004 */
#define DSI_WCR_LTDCEN              DSI_WCR_LTDCEN_Msk                   /*!< LTDC enable */
#define DSI_WCR_DSIEN_Pos           (3U)
#define DSI_WCR_DSIEN_Msk           (0x1UL << DSI_WCR_DSIEN_Pos)          /*!< 0x00000008 */
#define DSI_WCR_DSIEN               DSI_WCR_DSIEN_Msk                    /*!< DSI enable */

/*******************  Bit definition for DSI_WIER register  *******************/
#define DSI_WIER_TEIE_Pos           (0U)
#define DSI_WIER_TEIE_Msk           (0x1UL << DSI_WIER_TEIE_Pos)          /*!< 0x00000001 */
#define DSI_WIER_TEIE               DSI_WIER_TEIE_Msk                    /*!< Tearing effect interrupt enable */
#define DSI_WIER_ERIE_Pos           (1U)
#define DSI_WIER_ERIE_Msk           (0x1UL << DSI_WIER_ERIE_Pos)          /*!< 0x00000002 */
#define DSI_WIER_ERIE               DSI_WIER_ERIE_Msk                    /*!< End of refresh interrupt enable */
#define DSI_WIER_PLLLIE_Pos         (9U)
#define DSI_WIER_PLLLIE_Msk         (0x1UL << DSI_WIER_PLLLIE_Pos)        /*!< 0x00000200 */
#define DSI_WIER_PLLLIE             DSI_WIER_PLLLIE_Msk                  /*!< PLL lock interrupt enable */
#define DSI_WIER_PLLUIE_Pos         (10U)
#define DSI_WIER_PLLUIE_Msk         (0x1UL << DSI_WIER_PLLUIE_Pos)        /*!< 0x00000400 */
#define DSI_WIER_PLLUIE             DSI_WIER_PLLUIE_Msk                  /*!< PLL unlock interrupt enable */
#define DSI_WIER_LAEIE_Pos          (13U)
#define DSI_WIER_LAEIE_Msk          (0x1UL << DSI_WIER_LAEIE_Pos)         /*!< 0x00004000 */
#define DSI_WIER_LAEIE              DSI_WIER_LAEIE_Msk                   /*!< LCD APB Error interrupt flag */

/*******************  Bit definition for DSI_WISR register  *******************/
#define DSI_WISR_TEIF_Pos           (0U)
#define DSI_WISR_TEIF_Msk           (0x1UL << DSI_WISR_TEIF_Pos)          /*!< 0x00000001 */
#define DSI_WISR_TEIF               DSI_WISR_TEIF_Msk                    /*!< Tearing effect interrupt flag */
#define DSI_WISR_ERIF_Pos           (1U)
#define DSI_WISR_ERIF_Msk           (0x1UL << DSI_WISR_ERIF_Pos)          /*!< 0x00000002 */
#define DSI_WISR_ERIF               DSI_WISR_ERIF_Msk                    /*!< End of refresh interrupt flag */
#define DSI_WISR_BUSY_Pos           (2U)
#define DSI_WISR_BUSY_Msk           (0x1UL << DSI_WISR_BUSY_Pos)          /*!< 0x00000004 */
#define DSI_WISR_BUSY               DSI_WISR_BUSY_Msk                    /*!< Busy flag */
#define DSI_WISR_PLLLS_Pos          (8U)
#define DSI_WISR_PLLLS_Msk          (0x1UL << DSI_WISR_PLLLS_Pos)         /*!< 0x00000100 */
#define DSI_WISR_PLLLS              DSI_WISR_PLLLS_Msk                   /*!< PLL lock status */
#define DSI_WISR_PLLLIF_Pos         (9U)
#define DSI_WISR_PLLLIF_Msk         (0x1UL << DSI_WISR_PLLLIF_Pos)        /*!< 0x00000200 */
#define DSI_WISR_PLLLIF             DSI_WISR_PLLLIF_Msk                  /*!< PLL lock interrupt flag */
#define DSI_WISR_PLLUIF_Pos         (10U)
#define DSI_WISR_PLLUIF_Msk         (0x1UL << DSI_WISR_PLLUIF_Pos)        /*!< 0x00000400 */
#define DSI_WISR_PLLUIF             DSI_WISR_PLLUIF_Msk                  /*!< PLL unlock interrupt flag */
#define DSI_WISR_LAEIF_Pos          (14U)
#define DSI_WISR_LAEIF_Msk          (0x1UL << DSI_WISR_LAEIF_Pos)         /*!< 0x00004000 */
#define DSI_WISR_LAEIF              DSI_WISR_LAEIF_Msk                   /*!< LCD APB Error interrupt flag */

/******************  Bit definition for DSI_WIFCR register  *******************/
#define DSI_WIFCR_CTEIF_Pos         (0U)
#define DSI_WIFCR_CTEIF_Msk         (0x1UL << DSI_WIFCR_CTEIF_Pos)        /*!< 0x00000001 */
#define DSI_WIFCR_CTEIF             DSI_WIFCR_CTEIF_Msk                  /*!< Clear tearing effect interrupt flag */
#define DSI_WIFCR_CERIF_Pos         (1U)
#define DSI_WIFCR_CERIF_Msk         (0x1UL << DSI_WIFCR_CERIF_Pos)        /*!< 0x00000002 */
#define DSI_WIFCR_CERIF             DSI_WIFCR_CERIF_Msk                  /*!< Clear end of refresh interrupt flag */
#define DSI_WIFCR_CPLLLIF_Pos       (9U)
#define DSI_WIFCR_CPLLLIF_Msk       (0x1UL << DSI_WIFCR_CPLLLIF_Pos)      /*!< 0x00000200 */
#define DSI_WIFCR_CPLLLIF           DSI_WIFCR_CPLLLIF_Msk                /*!< Clear PLL lock interrupt flag */
#define DSI_WIFCR_CPLLUIF_Pos       (10U)
#define DSI_WIFCR_CPLLUIF_Msk       (0x1UL << DSI_WIFCR_CPLLUIF_Pos)      /*!< 0x00000400 */
#define DSI_WIFCR_CPLLUIF           DSI_WIFCR_CPLLUIF_Msk                /*!< Clear PLL unlock interrupt flag */
#define DSI_WIFCR_CLAEIF_Pos        (14U)
#define DSI_WIFCR_CLAEIF_Msk        (0x1UL << DSI_WIFCR_CLAEIF_Pos)       /*!< 0x00004000 */
#define DSI_WIFCR_CLAEIF            DSI_WIFCR_CLAEIF_Msk                 /*!< LCD APB Error interrupt flag */

/******************  Bit definition for DSI_WPCR0 register  *******************/
#define DSI_WPCR0_TDDL_Pos          (0U)
#define DSI_WPCR0_TDDL_Msk          (0x1UL << DSI_WPCR0_TDDL_Pos)         /*!< 0x00000001 */
#define DSI_WPCR0_TDDL              DSI_WPCR0_TDDL_Msk                   /*!< Turnaround Disable Data Lanes: */
#define DSI_WPCR0_FTXSMDL_Pos       (1U)
#define DSI_WPCR0_FTXSMDL_Msk       (0x1UL << DSI_WPCR0_FTXSMDL_Pos)      /*!< 0x00000002 */
#define DSI_WPCR0_FTXSMDL           DSI_WPCR0_FTXSMDL_Msk                /*!< Force to TX Stop Mode the Data Lanes: */
#define DSI_WPCR0_RXTRG_Pos         (4U)
#define DSI_WPCR0_RXTRG_Msk         (0x3UL << DSI_WPCR0_RXTRG_Pos)        /*!< 0x00000030 */
#define DSI_WPCR0_RXTRG             DSI_WPCR0_RXTRG_Msk                  /*!< Rx Trigger Escape Selection: */

/******************  Bit definition for DSI_WPCR1 register  *******************/
#define DSI_WPCR1_CCF_Pos           (0U)
#define DSI_WPCR1_CCF_Msk           (0x3FUL << DSI_WPCR1_CCF_Pos)         /*!< 0x0000003F */
#define DSI_WPCR1_CCF               DSI_WPCR1_CCF_Msk                    /*!< Configuration-Clock Frequency: */
#define DSI_WPCR1_HSFR_Pos          (8U)
#define DSI_WPCR1_HSFR_Msk          (0x7FUL << DSI_WPCR1_HSFR_Pos)        /*!< 0x00007F00 */
#define DSI_WPCR1_HSFR              DSI_WPCR1_HSFR_Msk                   /*!< High Speed Frequency Range in Tx Mode: */
#define DSI_WPCR1_DLD_Pos           (16U)
#define DSI_WPCR1_DLD_Msk           (0x1UL << DSI_WPCR1_DLD_Pos)          /*!< 0x00010000 */
#define DSI_WPCR1_DLD               DSI_WPCR1_DLD_Msk                    /*!< Data Lanes 0 Direction: */

/******************  Bit definition for DSI_WRPCR0 register  ******************/
#define DSI_WRPCR0_IDF_Pos          (0U)
#define DSI_WRPCR0_IDF_Msk          (0xFUL << DSI_WRPCR0_IDF_Pos)         /*!< 0x0000000F */
#define DSI_WRPCR0_IDF              DSI_WRPCR0_IDF_Msk                   /*!< PLL Input Division ratio: */
#define DSI_WRPCR0_NDIV_Pos         (4U)
#define DSI_WRPCR0_NDIV_Msk         (0x3FFUL << DSI_WRPCR0_NDIV_Pos)      /*!< 0x00003FF0 */
#define DSI_WRPCR0_NDIV             DSI_WRPCR0_NDIV_Msk                  /*!< PLL InLoop Division ratio: */
#define DSI_WRPCR0_PSC_Pos          (16U)
#define DSI_WRPCR0_PSC_Msk          (0x1UL << DSI_WRPCR0_PSC_Pos)         /*!< 0x00010000 */
#define DSI_WRPCR0_PSC              DSI_WRPCR0_PSC_Msk                   /*!< PLL Shadow Control: */

