STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_cm33.h
/*********  Bit definition for ETH_RX_VLAN_PACKETS_GOOD_BAD register  *********/
#define ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_Pos                    (0U)
#define ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_Msk                    (0xFFFFFFFFUL << ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_Pos)            /*!< 0xFFFFFFFF */
#define ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB                        ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_Msk                             /*!< Rx VLAN Packets Good Bad */

/********  Bit definition for ETH_RX_WATCHDOG_ERROR_PACKETS register  *********/
#define ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_Pos                      (0U)
#define ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_Msk                      (0xFFFFFFFFUL << ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_Pos)              /*!< 0xFFFFFFFF */
#define ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR                          ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_Msk                               /*!< Rx Watchdog Error Packets */

/*************  Bit definition for ETH_RX_RECEIVE_ERROR register  *************/
#define ETH_RX_RECEIVE_ERROR_RXRCVERR_Pos                               (0U)
#define ETH_RX_RECEIVE_ERROR_RXRCVERR_Msk                               (0xFFFFFFFFUL << ETH_RX_RECEIVE_ERROR_RXRCVERR_Pos)                       /*!< 0xFFFFFFFF */
#define ETH_RX_RECEIVE_ERROR_RXRCVERR                                   ETH_RX_RECEIVE_ERROR_RXRCVERR_Msk                                        /*!< Rx Receive Error Packets */

/*********  Bit definition for ETH_RX_CONTROL_PACKETS_GOOD register  **********/
#define ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_Pos                         (0U)
#define ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_Msk                         (0xFFFFFFFFUL << ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG                             ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_Msk                                  /*!< Rx Control Packets Good */

/*************  Bit definition for ETH_TX_LPI_USEC_CNTR register  *************/
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Pos                               (0U)
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Msk                               (0xFFFFFFFFUL << ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Pos)                       /*!< 0xFFFFFFFF */
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC                                   ETH_TX_LPI_USEC_CNTR_TXLPIUSC_Msk                                        /*!< Tx LPI Microseconds Counter */

/*************  Bit definition for ETH_TX_LPI_TRAN_CNTR register  *************/
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Pos                               (0U)
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Msk                               (0xFFFFFFFFUL << ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Pos)                       /*!< 0xFFFFFFFF */
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC                                   ETH_TX_LPI_TRAN_CNTR_TXLPITRC_Msk                                        /*!< Tx LPI Transition counter */

/*************  Bit definition for ETH_RX_LPI_USEC_CNTR register  *************/
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Pos                               (0U)
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Msk                               (0xFFFFFFFFUL << ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Pos)                       /*!< 0xFFFFFFFF */
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC                                   ETH_RX_LPI_USEC_CNTR_RXLPIUSC_Msk                                        /*!< Rx LPI Microseconds Counter */

/*************  Bit definition for ETH_RX_LPI_TRAN_CNTR register  *************/
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Pos                               (0U)
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Msk                               (0xFFFFFFFFUL << ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Pos)                       /*!< 0xFFFFFFFF */
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC                                   ETH_RX_LPI_TRAN_CNTR_RXLPITRC_Msk                                        /*!< Rx LPI Transition counter */

/**************  Bit definition for ETH_MMC_FPE_TX_ISR register  **************/
#define ETH_MMC_FPE_TX_ISR_FCIS_Pos                                     (0U)
#define ETH_MMC_FPE_TX_ISR_FCIS_Msk                                     (0x1UL << ETH_MMC_FPE_TX_ISR_FCIS_Pos)                                    /*!< 0x00000001 */
#define ETH_MMC_FPE_TX_ISR_FCIS                                         ETH_MMC_FPE_TX_ISR_FCIS_Msk                                              /*!< MMC Tx FPE Fragment Counter Interrupt status */
#define ETH_MMC_FPE_TX_ISR_HRCIS_Pos                                    (1U)
#define ETH_MMC_FPE_TX_ISR_HRCIS_Msk                                    (0x1UL << ETH_MMC_FPE_TX_ISR_HRCIS_Pos)                                   /*!< 0x00000002 */
#define ETH_MMC_FPE_TX_ISR_HRCIS                                        ETH_MMC_FPE_TX_ISR_HRCIS_Msk                                             /*!< MMC Tx Hold Request Counter Interrupt Status */

/**************  Bit definition for ETH_MMC_FPE_TX_IMR register  **************/
#define ETH_MMC_FPE_TX_IMR_FCIM_Pos                                     (0U)
#define ETH_MMC_FPE_TX_IMR_FCIM_Msk                                     (0x1UL << ETH_MMC_FPE_TX_IMR_FCIM_Pos)                                    /*!< 0x00000001 */
#define ETH_MMC_FPE_TX_IMR_FCIM                                         ETH_MMC_FPE_TX_IMR_FCIM_Msk                                              /*!< MMC Transmit Fragment Counter Interrupt Mask */
#define ETH_MMC_FPE_TX_IMR_HRCIM_Pos                                    (1U)
#define ETH_MMC_FPE_TX_IMR_HRCIM_Msk                                    (0x1UL << ETH_MMC_FPE_TX_IMR_HRCIM_Pos)                                   /*!< 0x00000002 */
#define ETH_MMC_FPE_TX_IMR_HRCIM                                        ETH_MMC_FPE_TX_IMR_HRCIM_Msk                                             /*!< MMC Transmit Hold Request Counter Interrupt Mask */

/**************  Bit definition for ETH_MMC_FPE_TX_FCR register  **************/
#define ETH_MMC_FPE_TX_FCR_TXFFC_Pos                                    (0U)
#define ETH_MMC_FPE_TX_FCR_TXFFC_Msk                                    (0xFFFFFFFFUL << ETH_MMC_FPE_TX_FCR_TXFFC_Pos)                            /*!< 0xFFFFFFFF */
#define ETH_MMC_FPE_TX_FCR_TXFFC                                        ETH_MMC_FPE_TX_FCR_TXFFC_Msk                                             /*!< Tx FPE Fragment counter */

/***************  Bit definition for ETH_MMC_TX_HRCR register  ****************/
#define ETH_MMC_TX_HRCR_TXHRC_Pos                                       (0U)
#define ETH_MMC_TX_HRCR_TXHRC_Msk                                       (0xFFFFFFFFUL << ETH_MMC_TX_HRCR_TXHRC_Pos)                               /*!< 0xFFFFFFFF */
#define ETH_MMC_TX_HRCR_TXHRC                                           ETH_MMC_TX_HRCR_TXHRC_Msk                                                /*!< Tx Hold Request Counter */

