STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_cm33.h
/*****************  Bit definition for LVDS_PMDTCR1 register  *****************/
#define LVDS_PMDTCR1_PMDTDL0_Pos                               (0U)
#define LVDS_PMDTCR1_PMDTDL0_Msk                               (0xFFUL << LVDS_PMDTCR1_PMDTDL0_Pos)                              /*!< 0x000000FF */
#define LVDS_PMDTCR1_PMDTDL0                                   LVDS_PMDTCR1_PMDTDL0_Msk                                         /*!< PHY Master Digital Test Data Lane 0. */
#define LVDS_PMDTCR1_PMDTDL0_0                                 (0x1UL << LVDS_PMDTCR1_PMDTDL0_Pos)                               /*!< 0x00000001 */
#define LVDS_PMDTCR1_PMDTDL0_1                                 (0x2UL << LVDS_PMDTCR1_PMDTDL0_Pos)                               /*!< 0x00000002 */
#define LVDS_PMDTCR1_PMDTDL0_2                                 (0x4UL << LVDS_PMDTCR1_PMDTDL0_Pos)                               /*!< 0x00000004 */
#define LVDS_PMDTCR1_PMDTDL0_3                                 (0x8UL << LVDS_PMDTCR1_PMDTDL0_Pos)                               /*!< 0x00000008 */
#define LVDS_PMDTCR1_PMDTDL0_4                                 (0x10UL << LVDS_PMDTCR1_PMDTDL0_Pos)                              /*!< 0x00000010 */
#define LVDS_PMDTCR1_PMDTDL0_5                                 (0x20UL << LVDS_PMDTCR1_PMDTDL0_Pos)                              /*!< 0x00000020 */
#define LVDS_PMDTCR1_PMDTDL0_6                                 (0x40UL << LVDS_PMDTCR1_PMDTDL0_Pos)                              /*!< 0x00000040 */
#define LVDS_PMDTCR1_PMDTDL0_7                                 (0x80UL << LVDS_PMDTCR1_PMDTDL0_Pos)                              /*!< 0x00000080 */
#define LVDS_PMDTCR1_PMDTDL1_Pos                               (8U)
#define LVDS_PMDTCR1_PMDTDL1_Msk                               (0xFFUL << LVDS_PMDTCR1_PMDTDL1_Pos)                              /*!< 0x0000FF00 */
#define LVDS_PMDTCR1_PMDTDL1                                   LVDS_PMDTCR1_PMDTDL1_Msk                                         /*!< PHY Master Digital Test Data Lane 1. */
#define LVDS_PMDTCR1_PMDTDL1_0                                 (0x1UL << LVDS_PMDTCR1_PMDTDL1_Pos)                             /*!< 0x00000100 */
#define LVDS_PMDTCR1_PMDTDL1_1                                 (0x2UL << LVDS_PMDTCR1_PMDTDL1_Pos)                             /*!< 0x00000200 */
#define LVDS_PMDTCR1_PMDTDL1_2                                 (0x4UL << LVDS_PMDTCR1_PMDTDL1_Pos)                             /*!< 0x00000400 */
#define LVDS_PMDTCR1_PMDTDL1_3                                 (0x8UL << LVDS_PMDTCR1_PMDTDL1_Pos)                             /*!< 0x00000800 */
#define LVDS_PMDTCR1_PMDTDL1_4                                 (0x10UL << LVDS_PMDTCR1_PMDTDL1_Pos)                            /*!< 0x00001000 */
#define LVDS_PMDTCR1_PMDTDL1_5                                 (0x20UL << LVDS_PMDTCR1_PMDTDL1_Pos)                            /*!< 0x00002000 */
#define LVDS_PMDTCR1_PMDTDL1_6                                 (0x40UL << LVDS_PMDTCR1_PMDTDL1_Pos)                            /*!< 0x00004000 */
#define LVDS_PMDTCR1_PMDTDL1_7                                 (0x80UL << LVDS_PMDTCR1_PMDTDL1_Pos)                            /*!< 0x00008000 */
#define LVDS_PMDTCR1_PMDTDL2_Pos                               (16U)
#define LVDS_PMDTCR1_PMDTDL2_Msk                               (0xFFUL << LVDS_PMDTCR1_PMDTDL2_Pos)                              /*!< 0x00FF0000 */
#define LVDS_PMDTCR1_PMDTDL2                                   LVDS_PMDTCR1_PMDTDL2_Msk                                         /*!< PHY Master Digital Test Data Lane 2. */
#define LVDS_PMDTCR1_PMDTDL2_0                                 (0x1UL << LVDS_PMDTCR1_PMDTDL2_Pos)                           /*!< 0x00010000 */
#define LVDS_PMDTCR1_PMDTDL2_1                                 (0x2UL << LVDS_PMDTCR1_PMDTDL2_Pos)                           /*!< 0x00020000 */
#define LVDS_PMDTCR1_PMDTDL2_2                                 (0x4UL << LVDS_PMDTCR1_PMDTDL2_Pos)                           /*!< 0x00040000 */
#define LVDS_PMDTCR1_PMDTDL2_3                                 (0x8UL << LVDS_PMDTCR1_PMDTDL2_Pos)                           /*!< 0x00080000 */
#define LVDS_PMDTCR1_PMDTDL2_4                                 (0x10UL << LVDS_PMDTCR1_PMDTDL2_Pos)                          /*!< 0x00100000 */
#define LVDS_PMDTCR1_PMDTDL2_5                                 (0x20UL << LVDS_PMDTCR1_PMDTDL2_Pos)                          /*!< 0x00200000 */
#define LVDS_PMDTCR1_PMDTDL2_6                                 (0x40UL << LVDS_PMDTCR1_PMDTDL2_Pos)                          /*!< 0x00400000 */
#define LVDS_PMDTCR1_PMDTDL2_7                                 (0x80UL << LVDS_PMDTCR1_PMDTDL2_Pos)                          /*!< 0x00800000 */
#define LVDS_PMDTCR1_PMDTDL3_Pos                               (24U)
#define LVDS_PMDTCR1_PMDTDL3_Msk                               (0xFFUL << LVDS_PMDTCR1_PMDTDL3_Pos)                              /*!< 0xFF000000 */
#define LVDS_PMDTCR1_PMDTDL3                                   LVDS_PMDTCR1_PMDTDL3_Msk                                         /*!< PHY Master Digital Test Data Lane 3. */
#define LVDS_PMDTCR1_PMDTDL3_0                                 (0x1UL << LVDS_PMDTCR1_PMDTDL3_Pos)                         /*!< 0x01000000 */
#define LVDS_PMDTCR1_PMDTDL3_1                                 (0x2UL << LVDS_PMDTCR1_PMDTDL3_Pos)                         /*!< 0x02000000 */
#define LVDS_PMDTCR1_PMDTDL3_2                                 (0x4UL << LVDS_PMDTCR1_PMDTDL3_Pos)                         /*!< 0x04000000 */
#define LVDS_PMDTCR1_PMDTDL3_3                                 (0x8UL << LVDS_PMDTCR1_PMDTDL3_Pos)                         /*!< 0x08000000 */
#define LVDS_PMDTCR1_PMDTDL3_4                                 (0x10UL << LVDS_PMDTCR1_PMDTDL3_Pos)                        /*!< 0x10000000 */
#define LVDS_PMDTCR1_PMDTDL3_5                                 (0x20UL << LVDS_PMDTCR1_PMDTDL3_Pos)                        /*!< 0x20000000 */
#define LVDS_PMDTCR1_PMDTDL3_6                                 (0x40UL << LVDS_PMDTCR1_PMDTDL3_Pos)                        /*!< 0x40000000 */
#define LVDS_PMDTCR1_PMDTDL3_7                                 (0x80UL << LVDS_PMDTCR1_PMDTDL3_Pos)                        /*!< 0x80000000 */

