STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_cm33.h
/* Bit fields for RCC_ETH1CFGR register */
#define RCC_ETH1CFGR_ETH1RST_Pos                     (0U)
#define RCC_ETH1CFGR_ETH1RST_Msk                     (0x1UL << RCC_ETH1CFGR_ETH1RST_Pos)                    /*!< 0x00000001 */
#define RCC_ETH1CFGR_ETH1RST                         RCC_ETH1CFGR_ETH1RST_Msk                              /*!< Ethernet 1 reset */
#define RCC_ETH1CFGR_ETH1MACEN_Pos                   (1U)
#define RCC_ETH1CFGR_ETH1MACEN_Msk                   (0x1UL << RCC_ETH1CFGR_ETH1MACEN_Pos)                  /*!< 0x00000002 */
#define RCC_ETH1CFGR_ETH1MACEN                       RCC_ETH1CFGR_ETH1MACEN_Msk                            /*!< Ethernet 1 bus clock enable */
#define RCC_ETH1CFGR_ETH1MACLPEN_Pos                 (2U)
#define RCC_ETH1CFGR_ETH1MACLPEN_Msk                 (0x1UL << RCC_ETH1CFGR_ETH1MACLPEN_Pos)                /*!< 0x00000004 */
#define RCC_ETH1CFGR_ETH1MACLPEN                     RCC_ETH1CFGR_ETH1MACLPEN_Msk                          /*!< Ethernet 1 bus clock enable during CSleep */
#define RCC_ETH1CFGR_ETH1STPEN_Pos                   (4U)
#define RCC_ETH1CFGR_ETH1STPEN_Msk                   (0x1UL << RCC_ETH1CFGR_ETH1STPEN_Pos)                  /*!< 0x00000010 */
#define RCC_ETH1CFGR_ETH1STPEN                       RCC_ETH1CFGR_ETH1STPEN_Msk                            /*!< Ethernet 1 kernel clocks enable during CStop  */
#define RCC_ETH1CFGR_ETH1EN_Pos                      (5U)
#define RCC_ETH1CFGR_ETH1EN_Msk                      (0x1UL << RCC_ETH1CFGR_ETH1EN_Pos)                     /*!< 0x00000020 */
#define RCC_ETH1CFGR_ETH1EN                          RCC_ETH1CFGR_ETH1EN_Msk                               /*!< Ethernet 1 kernel clock enable */
#define RCC_ETH1CFGR_ETH1LPEN_Pos                    (6U)
#define RCC_ETH1CFGR_ETH1LPEN_Msk                    (0x1UL << RCC_ETH1CFGR_ETH1LPEN_Pos)                   /*!< 0x00000040 */
#define RCC_ETH1CFGR_ETH1LPEN                        RCC_ETH1CFGR_ETH1LPEN_Msk                             /*!< Ethernet 1 kernel clock enable during CSleep  */
#define RCC_ETH1CFGR_ETH1TXEN_Pos                    (8U)
#define RCC_ETH1CFGR_ETH1TXEN_Msk                    (0x1UL << RCC_ETH1CFGR_ETH1TXEN_Pos)                   /*!< 0x00000100 */
#define RCC_ETH1CFGR_ETH1TXEN                        RCC_ETH1CFGR_ETH1TXEN_Msk                             /*!< Ethernet 1 transmission clock enable */
#define RCC_ETH1CFGR_ETH1TXLPEN_Pos                  (9U)
#define RCC_ETH1CFGR_ETH1TXLPEN_Msk                  (0x1UL << RCC_ETH1CFGR_ETH1TXLPEN_Pos)                 /*!< 0x00000200 */
#define RCC_ETH1CFGR_ETH1TXLPEN                      RCC_ETH1CFGR_ETH1TXLPEN_Msk                           /*!< Ethernet 1 transmission clock enable during CSleep  */
#define RCC_ETH1CFGR_ETH1RXEN_Pos                    (10U)
#define RCC_ETH1CFGR_ETH1RXEN_Msk                    (0x1UL << RCC_ETH1CFGR_ETH1RXEN_Pos)                   /*!< 0x00000400 */
#define RCC_ETH1CFGR_ETH1RXEN                        RCC_ETH1CFGR_ETH1RXEN_Msk                             /*!< Ethernet 1 reception clock enable */
#define RCC_ETH1CFGR_ETH1RXLPEN_Pos                  (11U)
#define RCC_ETH1CFGR_ETH1RXLPEN_Msk                  (0x1UL << RCC_ETH1CFGR_ETH1RXLPEN_Pos)                 /*!< 0x00000800 */
#define RCC_ETH1CFGR_ETH1RXLPEN                      RCC_ETH1CFGR_ETH1RXLPEN_Msk                           /*!< Ethernet 1 reception clock enable during CSleep  */

/* Bit fields for RCC_ETH2CFGR register */
#define RCC_ETH2CFGR_ETH2RST_Pos                     (0U)
#define RCC_ETH2CFGR_ETH2RST_Msk                     (0x1UL << RCC_ETH2CFGR_ETH2RST_Pos)                    /*!< 0x00000001 */
#define RCC_ETH2CFGR_ETH2RST                         RCC_ETH2CFGR_ETH2RST_Msk                              /*!< Ethernet 2 reset */
#define RCC_ETH2CFGR_ETH2MACEN_Pos                   (1U)
#define RCC_ETH2CFGR_ETH2MACEN_Msk                   (0x1UL << RCC_ETH2CFGR_ETH2MACEN_Pos)                  /*!< 0x00000002 */
#define RCC_ETH2CFGR_ETH2MACEN                       RCC_ETH2CFGR_ETH2MACEN_Msk                            /*!< Ethernet 2 bus clock enable */
#define RCC_ETH2CFGR_ETH2MACLPEN_Pos                 (2U)
#define RCC_ETH2CFGR_ETH2MACLPEN_Msk                 (0x1UL << RCC_ETH2CFGR_ETH2MACLPEN_Pos)                /*!< 0x00000004 */
#define RCC_ETH2CFGR_ETH2MACLPEN                     RCC_ETH2CFGR_ETH2MACLPEN_Msk                          /*!< Ethernet 2 bus clock enable during CSleep  */
#define RCC_ETH2CFGR_ETH2STPEN_Pos                   (4U)
#define RCC_ETH2CFGR_ETH2STPEN_Msk                   (0x1UL << RCC_ETH2CFGR_ETH2STPEN_Pos)                  /*!< 0x00000010 */
#define RCC_ETH2CFGR_ETH2STPEN                       RCC_ETH2CFGR_ETH2STPEN_Msk                            /*!< Ethernet 2 kernel clocks enable during CStop  */
#define RCC_ETH2CFGR_ETH2EN_Pos                      (5U)
#define RCC_ETH2CFGR_ETH2EN_Msk                      (0x1UL << RCC_ETH2CFGR_ETH2EN_Pos)                     /*!< 0x00000020 */
#define RCC_ETH2CFGR_ETH2EN                          RCC_ETH2CFGR_ETH2EN_Msk                               /*!< Ethernet 2 kernel clocks enable */
#define RCC_ETH2CFGR_ETH2LPEN_Pos                    (6U)
#define RCC_ETH2CFGR_ETH2LPEN_Msk                    (0x1UL << RCC_ETH2CFGR_ETH2LPEN_Pos)                   /*!< 0x00000040 */
#define RCC_ETH2CFGR_ETH2LPEN                        RCC_ETH2CFGR_ETH2LPEN_Msk                             /*!< Ethernet 2 kernel clocks enable during CSleep  */
#define RCC_ETH2CFGR_ETH2TXEN_Pos                    (8U)
#define RCC_ETH2CFGR_ETH2TXEN_Msk                    (0x1UL << RCC_ETH2CFGR_ETH2TXEN_Pos)                   /*!< 0x00000100 */
#define RCC_ETH2CFGR_ETH2TXEN                        RCC_ETH2CFGR_ETH2TXEN_Msk                             /*!< Ethernet 2 transmission clock enable */
#define RCC_ETH2CFGR_ETH2TXLPEN_Pos                  (9U)
#define RCC_ETH2CFGR_ETH2TXLPEN_Msk                  (0x1UL << RCC_ETH2CFGR_ETH2TXLPEN_Pos)                 /*!< 0x00000200 */
#define RCC_ETH2CFGR_ETH2TXLPEN                      RCC_ETH2CFGR_ETH2TXLPEN_Msk                           /*!< Ethernet 2 transmission clock enable during CSleep mode */
#define RCC_ETH2CFGR_ETH2RXEN_Pos                    (10U)
#define RCC_ETH2CFGR_ETH2RXEN_Msk                    (0x1UL << RCC_ETH2CFGR_ETH2RXEN_Pos)                   /*!< 0x00000400 */
#define RCC_ETH2CFGR_ETH2RXEN                        RCC_ETH2CFGR_ETH2RXEN_Msk                             /*!< Ethernet 2 reception clock enable */
#define RCC_ETH2CFGR_ETH2RXLPEN_Pos                  (11U)
#define RCC_ETH2CFGR_ETH2RXLPEN_Msk                  (0x1UL << RCC_ETH2CFGR_ETH2RXLPEN_Pos)                 /*!< 0x00000800 */
#define RCC_ETH2CFGR_ETH2RXLPEN                      RCC_ETH2CFGR_ETH2RXLPEN_Msk                           /*!< Ethernet 2 reception clock enable during CSleep  */
/*****************  Bit definition for RCC_USBHCFGR register  *****************/
#define RCC_USBHCFGR_USBHRST_Pos                     (0U)
#define RCC_USBHCFGR_USBHRST_Msk                     (0x1UL << RCC_USBHCFGR_USBHRST_Pos)                    /*!< 0x00000001 */
#define RCC_USBHCFGR_USBHRST                         RCC_USBHCFGR_USBHRST_Msk                              /*!< USBH reset */
#define RCC_USBHCFGR_USBHEN_Pos                      (1U)
#define RCC_USBHCFGR_USBHEN_Msk                      (0x1UL << RCC_USBHCFGR_USBHEN_Pos)                     /*!< 0x00000002 */
#define RCC_USBHCFGR_USBHEN                          RCC_USBHCFGR_USBHEN_Msk                               /*!< USBH peripheral clock enable */
#define RCC_USBHCFGR_USBHLPEN_Pos                    (2U)
#define RCC_USBHCFGR_USBHLPEN_Msk                    (0x1UL << RCC_USBHCFGR_USBHLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_USBHCFGR_USBHLPEN                        RCC_USBHCFGR_USBHLPEN_Msk                             /*!< USBH clock enable during CSleep  */
#define RCC_USBHCFGR_USBHSTPEN_Pos                   (4U)
#define RCC_USBHCFGR_USBHSTPEN_Msk                   (0x1UL << RCC_USBHCFGR_USBHSTPEN_Pos)                  /*!< 0x00000010 */
#define RCC_USBHCFGR_USBHSTPEN                       RCC_USBHCFGR_USBHSTPEN_Msk                            /*!< USBH clock enable during CStop  */

/* Bit fields for RCC_USB2CFGR register */
#define RCC_USB2CFGR_USB2RST_Pos                     0
#define RCC_USB2CFGR_USB2RST_Msk                     (0x1UL << 0)
#define RCC_USB2CFGR_USB2RST                         (0x1UL << 0)
#define RCC_USB2CFGR_USB2EN_Pos                      1
#define RCC_USB2CFGR_USB2EN_Msk                      (0x1UL << 1)
#define RCC_USB2CFGR_USB2EN                          (0x1UL << 1)
#define RCC_USB2CFGR_USB2LPEN_Pos                    2
#define RCC_USB2CFGR_USB2LPEN_Msk                    (0x1UL << 2)
#define RCC_USB2CFGR_USB2LPEN                        (0x1UL << 2)
#define RCC_USB2CFGR_USB2STPEN_Pos                   4
#define RCC_USB2CFGR_USB2STPEN_Msk                   (0x1UL << 4)
#define RCC_USB2CFGR_USB2STPEN                       (0x1UL << 4)

/* Bit fields for RCC_USB2PHY1CFGR register */
#define RCC_USB2PHY1CFGR_USB2PHY1RST_Pos             (0U)
#define RCC_USB2PHY1CFGR_USB2PHY1RST_Msk             (0x1UL << RCC_USB2PHY1CFGR_USB2PHY1RST_Pos)            /*!< 0x00000001 */
#define RCC_USB2PHY1CFGR_USB2PHY1RST                 RCC_USB2PHY1CFGR_USB2PHY1RST_Msk                      /*!< USB2PHY1 reset */
#define RCC_USB2PHY1CFGR_USB2PHY1EN_Pos              (1U)
#define RCC_USB2PHY1CFGR_USB2PHY1EN_Msk              (0x1UL << RCC_USB2PHY1CFGR_USB2PHY1EN_Pos)             /*!< 0x00000002 */
#define RCC_USB2PHY1CFGR_USB2PHY1EN                  RCC_USB2PHY1CFGR_USB2PHY1EN_Msk                       /*!< USB2PHY1 clock enable */
#define RCC_USB2PHY1CFGR_USB2PHY1LPEN_Pos            (2U)
#define RCC_USB2PHY1CFGR_USB2PHY1LPEN_Msk            (0x1UL << RCC_USB2PHY1CFGR_USB2PHY1LPEN_Pos)           /*!< 0x00000004 */
#define RCC_USB2PHY1CFGR_USB2PHY1LPEN                RCC_USB2PHY1CFGR_USB2PHY1LPEN_Msk                     /*!< USB2PHY1 clock enable during CSleep  */
#define RCC_USB2PHY1CFGR_USB2PHY1STPEN_Pos           (4U)
#define RCC_USB2PHY1CFGR_USB2PHY1STPEN_Msk           (0x1UL << RCC_USB2PHY1CFGR_USB2PHY1STPEN_Pos)          /*!< 0x00000010 */
#define RCC_USB2PHY1CFGR_USB2PHY1STPEN               RCC_USB2PHY1CFGR_USB2PHY1STPEN_Msk                    /*!< USB2PHY1 reference clock enable during CStop  */
#define RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Pos        (15U)
#define RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Msk        (0x1UL << RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Pos)       /*!< 0x00008000 */
#define RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL            RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Msk                 /*!< USB2PHY1 reference clock selection */

/* Bit fields for RCC_USB2PHY2CFGR register */
#define RCC_USB2PHY2CFGR_USB2PHY2RST_Pos             (0U)
#define RCC_USB2PHY2CFGR_USB2PHY2RST_Msk             (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2RST_Pos)            /*!< 0x00000001 */
#define RCC_USB2PHY2CFGR_USB2PHY2RST                 RCC_USB2PHY2CFGR_USB2PHY2RST_Msk                      /*!< USB2PHY2 reset */
#define RCC_USB2PHY2CFGR_USB2PHY2EN_Pos              (1U)
#define RCC_USB2PHY2CFGR_USB2PHY2EN_Msk              (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2EN_Pos)             /*!< 0x00000002 */
#define RCC_USB2PHY2CFGR_USB2PHY2EN                  RCC_USB2PHY2CFGR_USB2PHY2EN_Msk                       /*!< USB2PHY2 clock enable */
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN_Pos            (2U)
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN_Msk            (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2LPEN_Pos)           /*!< 0x00000004 */
#define RCC_USB2PHY2CFGR_USB2PHY2LPEN                RCC_USB2PHY2CFGR_USB2PHY2LPEN_Msk                     /*!< USB2PHY2 clock enable during CSleep  */
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN_Pos           (4U)
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN_Msk           (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2STPEN_Pos)          /*!< 0x00000010 */
#define RCC_USB2PHY2CFGR_USB2PHY2STPEN               RCC_USB2PHY2CFGR_USB2PHY2STPEN_Msk                    /*!< USB2PHY2 reference clock enable during CStop  */
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos        (15U)
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Msk        (0x1UL << RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos)       /*!< 0x00008000 */
#define RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL            RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Msk                 /*!< USB2PHY2 reference clock select */

